var calendarObject = [
	[["۲۷","18","٢٥",false,[],true],["۲۸","19","٢٦",false,[],true],["۲۹","20","٢٧",true,[],true],["۱","21","٢٨",true,["جشن نوروز/جشن سال نو"],false],["۲","22","٢٩",true,["عیدنوروز"],false],["۳","23","٠١",true,["عیدنوروز","روز جهانی هواشناسی[ 23 March ]"],false],["۴","24","٠٢",true,["عیدنوروز"],false],["۵","25","٠٣",false,[],false],["۶","26","٠٤",false,["روز امید، روز شادباش نویسی","زادروز آشو زرتشت، اَبَراِنسان بزرگ تاریخ"],false],["۷","27","٠٥",false,["روز جهانی تئاتر[ 27 March ]"],false],["۸","28","٠٦",false,[],false],["۹","29","٠٧",false,[],false],["۱۰","30","٠٨",false,["جشن آبانگاه"],false],["۱۱","31","٠٩",true,[],false],["۱۲","01","١٠",true,["روز جمهوری اسلامی"],false],["۱۳","02","١١",true,["جشن سیزده به در"],false],["۱۴","03","١٢",false,[],false],["۱۵","04","١٣",false,[],false],["۱۶","05","١٤",false,[],false],["۱۷","06","١٥",false,["سروش روز،جشن سروشگان","ولادت امام حسن مجتبی علیه السلام[ ١٥ رمضان ]"],false],["۱۸","07","١٦",true,["روز جهانی بهداشت[ 7 April ]"],false],["۱۹","08","١٧",false,["فروردین روز،جشن فروردینگان"],false],["۲۰","09","١٨",false,["شب قدر[ ١٨ رمضان ]"],false],["۲۱","10","١٩",false,["ضربت خوردن حضرت علی علیه السلام[ ١٩ رمضان ]"],false],["۲۲","11","٢٠",false,[],false],["۲۳","12","٢١",true,["شهادت حضرت علی علیه السلام[ ٢١ رمضان ]","روز دندانپزشک"],false],["۲۴","13","٢٢",false,["شب قدر[ ٢٢ رمضان ]"],false],["۲۵","14","٢٣",true,["روز بزرگداشت عطار نیشابوری"],false],["۲۶","15","٢٤",false,[],false],["۲۷","16","٢٥",false,[],false],["۲۸","17","٢٦",false,[],false],["۲۹","18","٢٧",false,["روز ارتش جمهوری اسلامی ایران"],false],["۳۰","19","٢٨",false,["روز علوم آزمایشگاهی، زاد روز حکیم سید اسماعیل جرجانی"],false],["۳۱","20","٢٩",false,[],false],["۱","21","٣٠",true,[],true]],
	[["۲۶","15","٢٤",false,[],true],["۲۷","16","٢٥",false,[],true],["۲۸","17","٢٦",false,[],true],["۲۹","18","٢٧",false,[],true],["۳۰","19","٢٨",false,[],true],["۳۱","20","٢٩",false,[],true],["۱","21","٣٠",true,["روز بزرگداشت سعدی"],false],["۲","22","٠١",true,["جشن گیاه آوری؛ روز زمین[ 22 April ]","عید سعید فطر[ ١ شوال ]"],false],["۳","23","٠٢",true,["روزبزرگداشت شیخ بهایی؛ روزملی کارآفرینی؛ روز معماری","تعطیل به مناسبت عید سعید فطر[ ٢ شوال ]"],false],["۴","24","٠٣",false,[],false],["۵","25","٠٤",false,[],false],["۶","26","٠٥",false,[],false],["۷","27","٠٦",false,["روز جهانی طراحی و گرافیک[ 27 April ]"],false],["۸","28","٠٧",true,[],false],["۹","29","٠٨",false,["روز ملی روانشناس و مشاور"],false],["۱۰","30","٠٩",false,["جشن چهلم نوروز؛ روز ملی خلیج فارس"],false],["۱۱","01","١٠",false,["روزجهانیکارگر[ 1 May ]"],false],["۱۲","02","١١",false,["روز معلم"],false],["۱۳","03","١٢",false,[],false],["۱۴","04","١٣",false,[],false],["۱۵","05","١٤",true,["جشن میانه بهار/جشن بهاربد؛ روز شیراز","روز جهانی ماما[ 5 May ]"],false],["۱۶","06","١٥",false,[],false],["۱۷","07","١٦",false,[],false],["۱۸","08","١٧",false,["روز جهانی صلیب سرخ و هلال احمر[ 8 May ]"],false],["۱۹","09","١٨",false,[],false],["۲۰","10","١٩",false,[],false],["۲۱","11","٢٠",false,[],false],["۲۲","12","٢١",true,["زادروز مریم میرزاخانی ریاضیدان ایرانی، روز جهانی زن در ریاضیات"],false],["۲۳","13","٢٢",false,[],false],["۲۴","14","٢٣",false,[],false],["۲۵","15","٢٤",false,["روز بزرگداشت فردوسی"],false],["۲۶","16","٢٥",true,["شهادت امام جعفر صادق علیه السلام[ ٢٥ شوال ]"],false],["۲۷","17","٢٦",false,["روز ارتباطات و روابط عمومی"],false],["۲۸","18","٢٧",false,["روز بزرگداشت حکیم عمر خیام","روز جهانی موزه و میراث فرهنگی[ 18 May ]"],false],["۲۹","19","٢٨",true,[],false],["۳۰","20","٢٩",false,[],false],["۳۱","21","٠١",false,["ولادت حضرت معصومه سلام الله علیها و روز دختران[ ١ ذوالقعده ]"],false],["۱","22","٠٢",false,[],true],["۲","23","٠٣",false,[],true],["۳","24","٠٤",false,[],true],["۴","25","٠٥",false,[],true],["۵","26","٠٦",true,[],true]],
	[["۳۰","20","٢٩",false,[],true],["۳۱","21","٠١",false,[],true],["۱","22","٠٢",false,["روز بهره وری و بهینه سازی مصرف","روز بزرگداشت ملاصدرا"],false],["۲","23","٠٣",false,[],false],["۳","24","٠٤",false,["فتح خرمشهر در عملیات بیت المقدس و روز مقاومت، ایثار و پیروزی"],false],["۴","25","٠٥",false,["روز دزفول، روز مقاومت و پایداری"],false],["۵","26","٠٦",true,[],false],["۶","27","٠٧",false,["خرداد روز،جشن خردادگان"],false],["۷","28","٠٨",false,[],false],["۸","29","٠٩",false,[],false],["۹","30","١٠",false,[],false],["۱۰","31","١١",false,["ولادت امامرضا علیه السلام[ ١١ ذوالقعده ]","روز جهانی بدون دخانیات[ 31 May ]"],false],["۱۱","01","١٢",false,[],false],["۱۲","02","١٣",true,[],false],["۱۳","03","١٤",false,[],false],["۱۴","04","١٥",true,["رحلت حضرت امام خمینی"],false],["۱۵","05","١٦",true,["قیام 15 خرداد","روز جهانی محیط زیست[ 5 June ]"],false],["۱۶","06","١٧",false,[],false],["۱۷","07","١٨",false,[],false],["۱۸","08","١٩",false,[],false],["۱۹","09","٢٠",true,[],false],["۲۰","10","٢١",false,["روز جهانی صنایع دستی[ 10 June ]"],false],["۲۱","11","٢٢",false,[],false],["۲۲","12","٢٣",false,["روز جهانی مبارزه با کار کودکان[ 12 June ]"],false],["۲۳","13","٢٤",false,[],false],["۲۴","14","٢٥",false,["روز جهانی اهدای خون[ 14 June ]"],false],["۲۵","15","٢٦",false,["روز ملی گل وگیاه"],false],["۲۶","16","٢٧",true,[],false],["۲۷","17","٢٨",false,["روز جهانی بیابان زدایی[ 17 June ]"],false],["۲۸","18","٢٩",false,[],false],["۲۹","19","٣٠",false,["شهادت امام محمد تقی علیه السلام[ ٣٠ ذوالقعده ]"],false],["۳۰","20","٠١",false,[],false],["۳۱","21","٠٢",false,[],false],["۱","22","٠٣",false,[],true],["۲","23","٠٤",true,[],true]],
	[["۲۷","17","٢٨",false,[],true],["۲۸","18","٢٩",false,[],true],["۲۹","19","٣٠",false,[],true],["۳۰","20","٠١",false,[],true],["۳۱","21","٠٢",false,[],true],["۱","22","٠٣",false,["جشن آب پاشونک، جشن آغاز تابستان"],false],["۲","23","٠٤",true,[],false],["۳","24","٠٥",false,[],false],["۴","25","٠٦",false,[],false],["۵","26","٠٧",false,["روز جهانی مبارزه با مواد مخدر[ 26 June ]","شهادت امام محمد باقر علیه السلام[ ٧ ذوالحجه ]"],false],["۶","27","٠٨",false,[],false],["۷","28","٠٩",false,["انفجار دفتر حزب جمهوری اسلامی و شهادت دکتر بهشتی و 72 نفر از اعضای حزب؛ روز قوه قضاییه","روز عرفه[ ٩ ذوالحجه ]"],false],["۸","29","١٠",true,["روز مبارزه با سلاح های شیمیایی و میکروبی","عید سعید قربان[ ١٠ ذوالحجه ]"],false],["۹","30","١١",true,[],false],["۱۰","01","١٢",false,["روز صنعت و معدن"],false],["۱۱","02","١٣",false,[],false],["۱۲","03","١٤",false,["شلیک به پرواز 655 ایران ایر توسط ناو وینسنس [ 1367 خورشیدی ]"],false],["۱۳","04","١٥",false,["تیر روز،جشن تیرگان","ولادت امام علی النقی الهادی علیه السلام[ ١٥ ذوالحجه ]"],false],["۱۴","05","١٦",false,["روز قلم"],false],["۱۵","06","١٧",false,["جشن خام خواری"],false],["۱۶","07","١٨",true,["عید سعید غدیر خم[ ١٨ ذوالحجه ]"],false],["۱۷","08","١٩",false,[],false],["۱۸","09","٢٠",false,["ولادت امام موسی کاظم علیه السلام[ ٢٠ ذوالحجه ]"],false],["۱۹","10","٢١",false,[],false],["۲۰","11","٢٢",false,[],false],["۲۱","12","٢٣",false,[],false],["۲۲","13","٢٤",false,["زادروز محمد خوارزمی، ریاضیدان و فیلسوف ایرانی و روز ملی فناوری اطلاعات"],false],["۲۳","14","٢٥",true,[],false],["۲۴","15","٢٦",false,[],false],["۲۵","16","٢٧",false,["روز بهزیستی و تامین اجتماعی"],false],["۲۶","17","٢٨",false,[],false],["۲۷","18","٢٩",false,["اعلام پذیرش قطعنامه 598 شورای امنیت از سوی ایران [ 1367 خورشیدی ]"],false],["۲۸","19","٠١",false,[],false],["۲۹","20","٠٢",false,[],false],["۳۰","21","٠٣",true,[],false],["۳۱","22","٠٤",false,[],false],["۱","23","٠٥",false,[],true],["۲","24","٠٦",false,[],true],["۳","25","٠٧",false,[],true],["۴","26","٠٨",false,[],true],["۵","27","٠٩",true,[],true],["۶","28","١٠",true,[],true]],
	[["۳۱","22","٠٤",false,[],true],["۱","23","٠٥",false,[],false],["۲","24","٠٦",false,[],false],["۳","25","٠٧",false,[],false],["۴","26","٠٨",false,[],false],["۵","27","٠٩",true,["تاسوعای حسینی[ ٩ محرم ]"],false],["۶","28","١٠",true,["عاشورای حسینی[ ١٠ محرم ]"],false],["۷","29","١١",false,["اَمرداد روز،جشناَمردادگان"],false],["۸","30","١٢",false,["روز بزرگداشت شیخ شهاب الدین سهروردی","شهادتامام زین العابدین علیه السلام[ ١٢ محرم ]"],false],["۹","31","١٣",false,[],false],["۱۰","01","١٤",false,["جشن چله تابستان","آغاز هفته جهانی شیردهی[ 1 August ]"],false],["۱۱","02","١٥",false,[],false],["۱۲","03","١٦",false,[],false],["۱۳","04","١٧",true,[],false],["۱۴","05","١٨",false,["صدور فرمان مشروطیت"],false],["۱۵","06","١٩",false,[],false],["۱۶","07","٢٠",false,[],false],["۱۷","08","٢١",false,["روز خبرنگار"],false],["۱۸","09","٢٢",false,[],false],["۱۹","10","٢٣",false,[],false],["۲۰","11","٢٤",true,[],false],["۲۱","12","٢٥",false,[],false],["۲۲","13","٢٦",false,["روز جهانی چپ دست ها[ 13 August ]"],false],["۲۳","14","٢٧",false,[],false],["۲۴","15","٢٨",false,[],false],["۲۵","16","٢٩",false,[],false],["۲۶","17","٣٠",false,[],false],["۲۷","18","٠١",true,[],false],["۲۸","19","٠٢",false,["سالروز وقایع 28 مرداد پس از برکناری محمد مصدق","سالروز فاجعه آتش زدن سینما رکس آبادان","روز جهانی عکاسی[ 19 August ]"],false],["۲۹","20","٠٣",false,[],false],["۳۰","21","٠٤",false,[],false],["۳۱","22","٠٥",false,[],false],["۱","23","٠٦",false,[],true],["۲","24","٠٧",false,[],true],["۳","25","٠٨",true,[],true]],
	[["۲۸","19","٠٢",false,[],true],["۲۹","20","٠٣",false,[],true],["۳۰","21","٠٤",false,[],true],["۳۱","22","٠٥",false,[],true],["۱","23","٠٦",false,["روز بزرگداشت ابوعلی سینا و روز پزشک"],false],["۲","24","٠٧",false,["آغاز هفته دولت"],false],["۳","25","٠٨",true,[],false],["۴","26","٠٩",false,["زادروز داراب (کوروش)","شهریور روز،جشن شهریورگان"],false],["۵","27","١٠",false,["روز بزرگداشت محمدبن زکریای رازی و روز داروساز"],false],["۶","28","١١",false,[],false],["۷","29","١٢",false,[],false],["۸","30","١٣",false,["انفجار در دفتر نخست‌وزیری جمهوری اسلامی ایران، روز مبارزه با تروریسم"],false],["۹","31","١٤",false,[],false],["۱۰","01","١٥",true,[],false],["۱۱","02","١٦",false,["روزصنعت چاپ"],false],["۱۲","03","١٧",false,[],false],["۱۳","04","١٨",false,["روز بزرگداشت ابوریحان بیرونی"],false],["۱۴","05","١٩",false,[],false],["۱۵","06","٢٠",true,["اربعین حسینی[ ٢٠ صفر ]"],false],["۱۶","07","٢١",false,[],false],["۱۷","08","٢٢",true,["قیام 17 شهریور"],false],["۱۸","09","٢٣",false,[],false],["۱۹","10","٢٤",false,["روز جهانی پیشگیری از خودکشی[ 10 September ]"],false],["۲۰","11","٢٥",false,["حمله به برج‌های دوقلوی مرکز تجارت جهانی[ 11 September ]"],false],["۲۱","12","٢٦",false,["روز سینما"],false],["۲۲","13","٢٧",false,["روز گرامیداشت برنامه نویسان[ 13 September ]"],false],["۲۳","14","٢٨",true,["رحلترسول اکرم؛شهادت امام حسن مجتبی علیه السلام[ ٢٨ صفر ]"],false],["۲۴","15","٢٩",true,[],false],["۲۵","16","٣٠",true,["شهادت امام رضا علیه السلام[ ٣٠ صفر ]"],false],["۲۶","17","٠١",false,["هجرت پیامبر اکرم از مکه به مدینه[ ١ ربيع الاول ]"],false],["۲۷","18","٠٢",false,["روز شعر و ادب پارسی وروز بزرگداشت استاد شهریار"],false],["۲۸","19","٠٣",false,[],false],["۲۹","20","٠٤",false,[],false],["۳۰","21","٠٥",false,["روز جهانی صلح[ 21 September ]"],false],["۳۱","22","٠٦",true,["آغاز هفته دفاع مقدس"],false]],
	[["۱","23","٠٧",false,["آغاز حمله مغول به ایران در پاییز 598 خورشیدی"],false],["۲","24","٠٨",true,["شهادت امام حسن عسکری علیه السلام[ ٨ ربيع الاول ]"],false],["۳","25","٠٩",false,[],false],["۴","26","١٠",false,[],false],["۵","27","١١",false,["روز جهانی جهانگردی[ 27 September ]"],false],["۶","28","١٢",false,["میلاد رسول اکرم به روایت اهل سنت[ ١٢ ربيع الاول ]"],false],["۷","29","١٣",true,["روز آتش نشانی و ایمنی","سقوط هواپیمای حامل جمعی از فرماندهان جنگ (کلاهدوز، نامجو، فلاحی، فکوری، جهان آرا) در سال 1360","روز بزرگداشت شمس تبریزی"],false],["۸","30","١٤",false,["روزبزرگداشت مولوی","روز جهانی ناشنوایان[ 30 September ]","روز جهانی ترجمه و مترجم[ 30 September ]"],false],["۹","01","١٥",false,["روز جهانی سالمندان[ 1 October ]"],false],["۱۰","02","١٦",false,["مهر روز،جشن مهرگان"],false],["۱۱","03","١٧",true,["میلاد رسول اکرم و امام جعفر صادق علیه السلام[ ١٧ ربيع الاول ]"],false],["۱۲","04","١٨",false,["آغاز هفته جهانی فضا[ 4 October ]"],false],["۱۳","05","١٩",false,["روز نیروی انتظامی","روز جهانی معلم[ 5 October ]"],false],["۱۴","06","٢٠",true,["روز دامپزشکی"],false],["۱۵","07","٢١",false,[],false],["۱۶","08","٢٢",false,["روز ملی کودک"],false],["۱۷","09","٢٣",false,["روز جهانی پست[ 9 October ]"],false],["۱۸","10","٢٤",false,["روز جهانی مبارزه با حکم اعدام[ 10 October ]"],false],["۱۹","11","٢٥",false,["روز جهانی دختر[ 11 October ]"],false],["۲۰","12","٢٦",false,["روز بزرگداشت حافظ"],false],["۲۱","13","٢٧",true,["روز پیروزی کاوه و فریدون بر ضحاک"],false],["۲۲","14","٢٨",false,["روز جهانی استاندارد[ 14 October ]"],false],["۲۳","15","٢٩",false,["روز جهانی عصای سفید[ 15 October ]"],false],["۲۴","16","٣٠",false,["روز جهانی غذا[ 16 October ]"],false],["۲۵","17","٠١",false,["روز جهانی ریشه کنی فقر[ 17 October ]"],false],["۲۶","18","٠٢",false,["روز تربیت بدنی و ورزش"],false],["۲۷","19","٠٣",false,[],false],["۲۸","20","٠٤",true,[],false],["۲۹","21","٠٥",false,["روز ملی کوهنورد"],false],["۳۰","22","٠٦",false,[],false],["۱","23","٠٧",false,[],true],["۲","24","٠٨",false,[],true],["۳","25","٠٩",false,[],true],["۴","26","١٠",false,[],true],["۵","27","١١",true,[],true]],
	[["۲۹","21","٠٥",false,[],true],["۳۰","22","٠٦",false,[],true],["۱","23","٠٧",false,["روز آمار و برنامه ریزی"],false],["۲","24","٠٨",false,["ولادت امام حسن عسکری علیه السلام[ ٨ ربيع الثاني ]"],false],["۳","25","٠٩",false,[],false],["۴","26","١٠",false,["وفات حضرت معصومه سلام الله علیها[ ١٠ ربيع الثاني ]"],false],["۵","27","١١",true,[],false],["۶","28","١٢",false,[],false],["۷","29","١٣",false,["سالروز ورود کوروش بزرگ به بابل در سال 539 پیش از میلاد"],false],["۸","30","١٤",false,["روز نوجوان"],false],["۹","31","١٥",false,[],false],["۱۰","01","١٦",false,["آبان روز، جشن آبانگان"],false],["۱۱","02","١٧",false,[],false],["۱۲","03","١٨",true,[],false],["۱۳","04","١٩",false,["روز دانش آموز"],false],["۱۴","05","٢٠",false,["روز فرهنگ عمومی"],false],["۱۵","06","٢١",false,["جشن میانه پاییز"],false],["۱۶","07","٢٢",false,[],false],["۱۷","08","٢٣",false,[],false],["۱۸","09","٢٤",false,["روز ملی کیفیت"],false],["۱۹","10","٢٥",true,[],false],["۲۰","11","٢٦",false,[],false],["۲۱","12","٢٧",false,[],false],["۲۲","13","٢٨",false,[],false],["۲۳","14","٢٩",false,["روز جهانی دیابت[ 14 November ]"],false],["۲۴","15","٠١",false,["روز کتاب و کتابخوانی"],false],["۲۵","16","٠٢",false,["روز جهانی فلسفه[ 16 November ]"],false],["۲۶","17","٠٣",true,[],false],["۲۷","18","٠٤",false,[],false],["۲۸","19","٠٥",false,["ولادت حضرت زینب سلام الله علیها و روز پرستار و بهورز[ ٥ جمادي الاولي ]","روز جهانی آقایان[ 19 November ]"],false],["۲۹","20","٠٦",false,["روز جهانی کودک[ 20 November ]"],false],["۳۰","21","٠٧",false,[],false],["۱","22","٠٨",false,[],true],["۲","23","٠٩",false,[],true],["۳","24","١٠",true,[],true]],
	[["۲۷","18","٠٤",false,[],true],["۲۸","19","٠٥",false,[],true],["۲۹","20","٠٦",false,[],true],["۳۰","21","٠٧",false,[],true],["۱","22","٠٨",false,["آذر جشن"],false],["۲","23","٠٩",false,[],false],["۳","24","١٠",true,[],false],["۴","25","١١",false,["روز جهانی مبارزه با خشونت علیه زنان[ 25 November ]"],false],["۵","26","١٢",false,["روز بسیج مستضعفان"],false],["۶","27","١٣",false,[],false],["۷","28","١٤",false,["روز نیروی دریایی"],false],["۸","29","١٥",false,[],false],["۹","30","١٦",false,["جشن آذرگان ،آذر روز"],false],["۱۰","01","١٧",true,["روز مجلس","روز جهانی ایدز[ 1 December ]"],false],["۱۱","02","١٨",false,[],false],["۱۲","03","١٩",false,["روز جهانی معلولان[ 3 December ]"],false],["۱۳","04","٢٠",false,["روز بیمه"],false],["۱۴","05","٢١",false,[],false],["۱۵","06","٢٢",false,["روز حسابدار"],false],["۱۶","07","٢٣",false,["روز دانشجو"],false],["۱۷","08","٢٤",true,[],false],["۱۸","09","٢٥",false,[],false],["۱۹","10","٢٦",false,["روز جهانی حقوق بشر[ 10 December ]"],false],["۲۰","11","٢٧",false,["روز جهانی کوه نوردی[ 11 December ]"],false],["۲۱","12","٢٨",false,[],false],["۲۲","13","٢٩",false,[],false],["۲۳","14","٣٠",false,[],false],["۲۴","15","٠١",true,[],false],["۲۵","16","٠٢",false,["روز پژوهش"],false],["۲۶","17","٠٣",true,["روز حمل و نقل","شهادت حضرت فاطمه زهرا سلام الله علیها[ ٣ جمادي الثانيه ]"],false],["۲۷","18","٠٤",false,[],false],["۲۸","19","٠٥",false,[],false],["۲۹","20","٠٦",false,[],false],["۳۰","21","٠٧",false,["جشن شب یلدا"],false],["۱","22","٠٨",true,[],true]],
	[["۲۵","16","٠٢",false,[],true],["۲۶","17","٠٣",true,[],true],["۲۷","18","٠٤",false,[],true],["۲۸","19","٠٥",false,[],true],["۲۹","20","٠٦",false,[],true],["۳۰","21","٠٧",false,[],true],["۱","22","٠٨",true,["روز میلاد خورشید؛ جشن خرم روز، نخستین جشن دیگان"],false],["۲","23","٠٩",false,[],false],["۳","24","١٠",false,[],false],["۴","25","١١",false,["جشن کریسمس[ 25 December ]","روز بزرگداشت دوستی[ 25 December ]"],false],["۵","26","١٢",false,["زمین لرزه ی بم [1382 خورشیدی]","سالروز شهادت آشو زرتشت، اَبَراِنسان بزرگ تاریخ"],false],["۶","27","١٣",false,[],false],["۷","28","١٤",false,[],false],["۸","29","١٥",true,["دی به آذر روز، دومین جشن دیگان"],false],["۹","30","١٦",false,[],false],["۱۰","31","١٧",false,[],false],["۱۱","01","١٨",false,["جشن آغاز سال نو میلادی[ 1 January ]"],false],["۱۲","02","١٩",false,[],false],["۱۳","03","٢٠",false,["ولادت حضرت فاطمه زهرا سلام الله علیها و روز مادر[ ٢٠ جمادي الثانيه ]","شهادت سردار حاج قاسم سلیمانی [1398 خورشیدی]"],false],["۱۴","04","٢١",false,[],false],["۱۵","05","٢٢",true,["دی به مهر روز، سومین جشن دیگان"],false],["۱۶","06","٢٣",false,["غرق شدن کشتی سانچی [1396 خورشیدی]"],false],["۱۷","07","٢٤",false,[],false],["۱۸","08","٢٥",false,["شلیک به پرواز 752 هواپیمایی اوکراین [1398 خورشیدی]"],false],["۱۹","09","٢٦",false,["درگذشت اکبر هاشمی رفسنجانی [1395 خورشیدی]"],false],["۲۰","10","٢٧",false,["قتل امیرکبیر به دستور ناصرالدین شاه قاجار [1230 خورشیدی]"],false],["۲۱","11","٢٨",false,[],false],["۲۲","12","٢٩",true,[],false],["۲۳","13","٠١",false,["دی به دین روز، چهارمین جشن دیگان","ولادتامام محمد باقر علیه السلام[ ١ رجب ]"],false],["۲۴","14","٠٢",false,[],false],["۲۵","15","٠٣",false,["شهادت امام علی النقی الهادی علیه السلام[ ٣ رجب ]"],false],["۲۶","16","٠٤",false,[],false],["۲۷","17","٠٥",false,[],false],["۲۸","18","٠٦",false,[],false],["۲۹","19","٠٧",true,[],false],["۳۰","20","٠٨",false,["آتش‌سوزی و فروریختن ساختمان پلاسکو [1395 خورشیدی]"],false],["۱","21","٠٩",false,[],true],["۲","22","١٠",false,[],true],["۳","23","١١",false,[],true],["۴","24","١٢",false,[],true],["۵","25","١٣",true,[],true],["۶","26","١٤",true,[],true]],
	[["۳۰","20","٠٨",false,[],true],["۱","21","٠٩",false,["زادروز فردوسی"],false],["۲","22","١٠",false,["بهمن روز، جشن بهمنگان","ولادت امام محمد تقی علیه السلام[ ١٠ رجب ]"],false],["۳","23","١١",false,[],false],["۴","24","١٢",false,[],false],["۵","25","١٣",true,["جشن نوسره","ولادت امام علی علیه السلام و روز پدر[ ١٣ رجب ]"],false],["۶","26","١٤",true,[],false],["۷","27","١٥",false,["وفات حضرت زینب سلام الله علیها[ ١٥ رجب ]"],false],["۸","28","١٦",false,[],false],["۹","29","١٧",false,[],false],["۱۰","30","١٨",false,["جشن سده"],false],["۱۱","31","١٩",false,[],false],["۱۲","01","٢٠",false,["بازگشت امام خمینی (ره) به ایران"],false],["۱۳","02","٢١",true,[],false],["۱۴","03","٢٢",false,[],false],["۱۵","04","٢٣",false,["جشن میانه زمستان"],false],["۱۶","05","٢٤",false,[],false],["۱۷","06","٢٥",false,["شهادت امام موسی کاظم علیه السلام[ ٢٥ رجب ]"],false],["۱۸","07","٢٦",false,[],false],["۱۹","08","٢٧",true,["روز نیروی هوایی","مبعث رسول اکرم (ص)[ ٢٧ رجب ]"],false],["۲۰","09","٢٨",true,[],false],["۲۱","10","٢٩",false,[],false],["۲۲","11","٠١",true,["پیروزی انقلاب اسلامی","حمله به سفارت روسیه و قتل گریبایدوف سفیر روسیه تزاری در ایران[ 11 February ]"],false],["۲۳","12","٠٢",false,["زادروز چارلز داروین بنیانگذار نظریه‌ی فرگشت از طریق انتخاب طبیعی[ 12 February ]"],false],["۲۴","13","٠٣",false,["ولادت سالار شهیدان، امام حسین علیه السلام و روز پاسدار[ ٣ شعبان ]"],false],["۲۵","14","٠٤",false,["ولادت ابوالفضل العباس علیه السلام و روز جانباز[ ٤ شعبان ]","جشن ولنتاین[ 14 February ]"],false],["۲۶","15","٠٥",false,["ولادت امام زین العابدین علیه السلام[ ٥ شعبان ]"],false],["۲۷","16","٠٦",true,[],false],["۲۸","17","٠٧",false,[],false],["۲۹","18","٠٨",false,["جشن سپندارمذگان و روز عشق","فاجعه انفجار قطار نیشابور [1382 خورشیدی]"],false],["۳۰","19","٠٩",false,[],false],["۱","20","١٠",false,[],true],["۲","21","١١",false,[],true],["۳","22","١٢",false,[],true],["۴","23","١٣",true,[],true]],
	[["۲۸","17","٠٧",false,[],true],["۲۹","18","٠٨",false,[],true],["۳۰","19","٠٩",false,[],true],["۱","20","١٠",false,[],false],["۲","21","١١",false,["ولادت علی اکبر علیه السلام و روز جوان[ ١١ شعبان ]"],false],["۳","22","١٢",false,[],false],["۴","23","١٣",true,[],false],["۵","24","١٤",false,["روز بزرگداشت زمین و بانوان","روز بزرگداشت خواجه نصیر الدین طوسی و روز مهندس"],false],["۶","25","١٥",true,["ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان[ ١٥ شعبان ]"],false],["۷","26","١٦",false,["سالروز استقلال کانون وکلای دادگستری و روز وکیل مدافع","سالروز درگذشت علی اکبر دهخدا"],false],["۸","27","١٧",false,[],false],["۹","28","١٨",false,[],false],["۱۰","29","١٩",false,[],false],["۱۱","01","٢٠",true,[],false],["۱۲","02","٢١",false,[],false],["۱۳","03","٢٢",false,[],false],["۱۴","04","٢٣",false,[],false],["۱۵","05","٢٤",false,["روز درختکاری"],false],["۱۶","06","٢٥",false,[],false],["۱۷","07","٢٦",false,[],false],["۱۸","08","٢٧",true,["روزجهانی زنان[ 8 March ]"],false],["۱۹","09","٢٨",false,[],false],["۲۰","10","٢٩",false,[],false],["۲۱","11","٣٠",false,[],false],["۲۲","12","٠١",false,[],false],["۲۳","13","٠٢",false,[],false],["۲۴","14","٠٣",false,["روز جهانی عدد پیπ[ 14 March ]"],false],["۲۵","15","٠٤",true,["پایان سرایش شاهنامه"],false],["۲۶","16","٠٥",false,[],false],["۲۷","17","٠٦",false,[],false],["۲۸","18","٠٧",false,[],false],["۲۹","19","٠٨",true,["روز ملی شدن صنعت نفت ایران"],false],["۱","20","٠٩",true,[],true],["۲","21","١٠",true,[],true],["۳","22","١١",true,[],true]]
	];

const metaYear = {
    year: 1402,
    metaYear: [
        "March - April 2023 | شعبان - رمضان - ١٤٤٤",
        "April - May 2023 | رمضان - شوال - ١٤٤٤",
        "May - June 2023 | ذوالقعده - ذوالحجه - ١٤٤٤",
        "June - July 2023 | ذوالحجه - محرم - ١٤٤٤",
        "July - August 2023 | محرم - صفر - ١٤٤٥",
        "August - September 2023 | صفر - ربيع الاول - ١٤٤٥",
        "September - October 2023 | ربيع الاول - ربيع الثاني - ١٤٤٥",
        "October - November 2023 | ربيع الثاني - جمادي الاولي - ١٤٤٥",
        "November - December 2023 | جمادي الاولي - جمادي الثانيه - ١٤٤٥",
        "December 2023 - January 2024 | جمادي الثانيه - رجب - ١٤٤٥",
        "January - February 2024 | رجب - شعبان - ١٤٤٥",
        "February - March 2024 | شعبان - رمضان - ١٤٤٥",
    ]
}

const cssProperty = {

    "spring": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #5e991a;",
                "color: white;",
            ]
        },

        {
            selector: ".active-season",
            property: [
                "background-color: #5e991a !important;",
                "color:white !important;",
            ]
        },

        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #5e991a !important;"
            ]
        },

        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #5e991a !important;",
            ]
        },

        {
            selector: ".year-meta, .year",
            property: [
                "color: #5e991a;",
            ]
        }
    ],

    "summer": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #4caf50 ;",
                "color: white;",
            ]
        },

        {
            selector: ".active-season",
            property: [
                "background-color: #4caf50  !important;",
                "color:white !important;",
            ]
        },

        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #4caf50  !important;"
            ]
        },

        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #4caf50  !important;",
            ]
        },

        {
            selector: ".year-meta, .year",
            property: [
                "color: #4caf50 ;",
            ]
        }
    ],

    "fall": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #ff9800;",
                "color: white;",
            ]
        },

        {
            selector: ".active-season",
            property: [
                "background-color: #ff9800 !important;",
                "color:white !important;",
            ]
        },

        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #ff9800 !important;"
            ]
        },

        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #ff9800 !important;",
            ]
        },

        {
            selector: ".year-meta, .year",
            property: [
                "color: #ff9800;",
            ]
        }
    ],

    "winter": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #0984e3;",
                "color: white;",
            ]
        },

        {
            selector: ".active-season",
            property: [
                "background-color: #0984e3 !important;",
                "color:white !important;",
            ]
        },

        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #0984e3 !important;"
            ]
        },

        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #0984e3 !important;",
            ]
        },

        {
            selector: ".year-meta, .year",
            property: [
                "color: #0984e3;",
            ]
        }
    ]
};